'''
1)комп загадує слово і сообщає скільки там букв
2) 5 попиток щоб узнати букву
3) і останнє це угадати саме слово

'''
import random 

WORDS =("питон", "анаграмма", "простая", "сложная", "ответ", "подстаканник")

word = random.choice(WORDS)
print('Компютер загадал слово')
print('У вас только 5 попыток чтоб отгадать слово ')
print('В слове ',len(word),' букв')

i = 4
dor = input('Назовите вашу букву ')
while i!=0:
	if dor in word:
		print('Да')
	else:
		print('Нет')
	i -= 1
	dor = input('Назовите вашу букву ')


gest = input('введите ваше слово ')
while gest != word and gest != '':
	print('Вы не угадали')
	gest = input('введите ваше слово ')
if gest == word:
	print('Поздравляю вы угадали!')